2017-11-06-NYC-Lecture-Notes-master/Tweetstagram/app/controllers/api/comments_controller.rb

  def index
    @comments = Tweet.find(params[:tweet_id]).comments
---
SELECT  "tweets".* FROM "tweets" WHERE "tweets"."id" = $1 LIMIT $2  [["id", 15], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."tweet_id" = $1  [["tweet_id", 15]]

  def destroy
    @comment = Comment.find(params[:id])
    @comment.destroy!
---
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = $1  [["id", 10]]