2017-11-06-NYC-Lecture-Notes-master/Tweetstagram/app/controllers/api/tweets_controller.rb

  def index
    # including author here because we iterate over tweets and call tweet.author on each in jbuilder; prevents an N+1 query
    @tweets = Tweet.order(created_at: :desc).includes(:author, :comments)
---
SELECT  "tweets".* FROM "tweets" ORDER BY "tweets"."created_at" DESC LIMIT $1  [["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."tweet_id" IN (11, 10, 9, 8, 7, 6, 5, 4, 3, 2, 1)

  def create
    @tweet = Tweet.new(tweet_params)
    # randomly assign user until frontend authentication
    @tweet.author = User.all.sample

    if @tweet.save
---
SELECT "users".* FROM "users"
INSERT INTO "tweets" ("body", "author_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["body", "UTICA!"], ["author_id", 6], ["created_at", "2017-12-19 15:46:44.857286"], ["updated_at", "2017-12-19 15:46:44.857286"]]