2017-11-06-NYC-Lecture-Notes-master/Tweetstagram/app/controllers/tweets_controller.rb

SELECT "tweets".* FROM "tweets"
---
  def index
    @tweets = Tweet.all

SELECT  "tweets".* FROM "tweets" WHERE "tweets"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
---
  def show
    @tweet = Tweet.find(params[:id])

INSERT INTO "tweets" ("body", "author_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["body", "i love twitter"], ["author_id", 27], ["created_at", "2017-11-27 17:08:46.031348"], ["updated_at", "2017-11-27 17:08:46.031348"]]
INSERT INTO "users" ("username", "created_at", "updated_at", "password_digest", "session_token") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  def create
    @tweet = Tweet.new(tweet_params)
    @tweet.author = current_user

    respond_to do |format|
      format.html do
        if @tweet.save

SELECT  "tweets".* FROM "tweets" WHERE "tweets"."id" = $1 LIMIT $2  [["id", 13], ["LIMIT", 1]]
UPDATE "tweets" SET "body" = $1, "updated_at" = $2 WHERE "tweets"."id" = $3  [["body", "i really hate twitter"], ["updated_at", "2017-11-27 17:30:12.088483"], ["id", 13]]
---
  def update
    tweet = Tweet.find(params[:id])
    if tweet.update(tweet_params)

SELECT  "tweets".* FROM "tweets" WHERE "tweets"."id" = $1 LIMIT $2  [["id", 13], ["LIMIT", 1]]
DELETE FROM "tweets" WHERE "tweets"."id" = $1  [["id", 13]]
---
  def destroy
    tweet = Tweet.find(params[:id])
    tweet.destroy