2018-01-15-NYC-Lecture-Notes-master/W6D3/AJAXdemo/app/controllers/gifs_controller.rb

  def create
    @gif = Gif.new(gif_params)
    if @gif.save
---
INSERT INTO "gifs" ("title", "url") VALUES ($1, $2) RETURNING "id"  [["title", "new"], ["url", "https://media2.giphy.com/media/pFKSA95OcprBC/giphy.gif"]]

  def show
    @gif = Gif.find_by_title(params[:title])
---
SELECT  "gifs".* FROM "gifs" WHERE "gifs"."title" = $1 LIMIT $2  [["title", "new"], ["LIMIT", 1]]