OmniAuthDevise-master/app/controllers/omniauth_callbacks_controller.rb

SELECT "authorizations".* FROM "authorizations" WHERE "authorizations"."user_id" = 1 AND "authorizations"."provider" = 'Facebook' LIMIT 1
INSERT INTO "authorizations" ("created_at", "link", "name", "provider", "secret", "token", "uid", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
INSERT INTO "users" ("authentication_token", "confirmation_sent_at", "confirmation_token", "confirmed_at", "created_at", "current_sign_in_at", "current_sign_in_ip", "email", "encrypted_password", "failed_attempts", "last_sign_in_at", "last_sign_in_ip", "locked_at", "name", "remember_created_at", "reset_password_sent_at", "reset_password_token", "sign_in_count", "unconfirmed_email", "unlock_token", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
      user = resource
    end

    auth = user.authorizations.find_by_provider(provider)
    if auth.nil?
      auth = user.authorizations.build(:provider => provider)
      user.authorizations << auth

SELECT "authorizations".* FROM "authorizations" WHERE "authorizations"."uid" = '31248614' LIMIT 1
---
  def find_for_oauth_by_uid(uid, resource=nil)
    user = nil
    if auth = Authorization.find_by_uid(uid.to_s)

SELECT "users".* FROM "users" WHERE "users"."email" = 'cj@cjavilla.com' LIMIT 1
UPDATE "users" SET "last_sign_in_at" = '2013-09-03 02:11:18.797732', "current_sign_in_at" = '2013-11-05 04:48:17.639826', "sign_in_count" = 3, "updated_at" = '2013-11-05 04:48:17.640343' WHERE "users"."id" = 8
---
  def find_for_oauth_by_email(email, resource=nil)
    if user = User.find_by_email(email)
      user
    else
      user = User.new(:email => email, :password => Devise.friendly_token[0,20])
      user.save

SELECT "users".* FROM "users" WHERE "users"."name" = 'w1zeman1p' LIMIT 1
---
  def find_for_oauth_by_name(name, resource=nil)
    if user = User.find_by_name(name)