OmniAuthDevise-master/app/controllers/tweets_controller.rb

SELECT "tweets".* FROM "tweets" WHERE "tweets"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @tweet = Tweet.find(params[:id])

SELECT "tweets".* FROM "tweets" WHERE "tweets"."id" = ? LIMIT 1  [["id", "1"]]
---
  def edit
    @tweet = Tweet.find(params[:id])

INSERT INTO "tweets" ("body", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["body", "test"], ["created_at", Tue, 03 Sep 2013 02:15:30 UTC +00:00], ["updated_at", Tue, 03 Sep 2013 02:15:30 UTC +00:00], ["user_id", 8]]
---
  def create
    @tweet = current_user.tweets.new(params[:tweet])

    respond_to do |format|
      if @tweet.save

SELECT "tweets".* FROM "tweets" WHERE "tweets"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "tweets" SET "body" = 'testt', "updated_at" = '2013-09-03 02:15:36.007738' WHERE "tweets"."id" = 1
---
  def update
    @tweet = Tweet.find(params[:id])

    respond_to do |format|
      if @tweet.update_attributes(params[:tweet])